ERP.belugaerp/src/InformationRegisters/бг_МоментальноеФормированиеПроводок/бг_МоментальноеФормированиеПроводок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_МоментальноеФормированиеПроводок</name>
  <resources>
    <name>ФормироватьПроводкиСразу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/CommonModules/бг_ПодпискиНаСобытия/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ФормированиеПроводокПриПроведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИмяДокумента = Источник.Метаданные().Имя;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_МоментальноеФормированиеПроводок.ФормироватьПроводкиСразу КАК ФормироватьПроводкиСразу
	|ИЗ
	|	РегистрСведений.бг_МоментальноеФормированиеПроводок КАК бг_МоментальноеФормированиеПроводок
	|ГДЕ
	|	бг_МоментальноеФормированиеПроводок.ИмяДокумента = &ИмяДокумента
	|	И бг_МоментальноеФормированиеПроводок.ФормироватьПроводкиСразу";
	
	Запрос.УстановитьПараметр("ИмяДокумента", ИмяДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	РеглУчетПроведениеСервер.ОтразитьДокумент(Источник);
	
КонецПроцедуры

#КонецОбласти
